app/controllers/users_controller.rb

  def user_team_index
    @users = User.where(team:"Engineering")
---
SELECT "users".* FROM "users" WHERE "users"."team" = $1  [["team", "Engineering"]]